Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.Placings Enumeration
 The placing types of the objects.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum Placings
Public Enumeration Placings
Members
Member name | Value | Description
Free | 0 |  The placing of the object is free.
Fixed | 1 |  The placing of the object is fixed.
See Also
Reference
Tekla.Structures.Drawing Namespace